Revit 2027 API
FailureDefinitionId.Equality Operator
Compares two FailureDefinitionId instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	FailureDefinitionId first,
	FailureDefinitionId second
)
Public Shared Operator = (
	first As FailureDefinitionId,
	second As FailureDefinitionId
) As Boolean
public:
static bool operator ==(
	FailureDefinitionId^ first,
	FailureDefinitionId^ second
)
static let inline (=)
        first : FailureDefinitionId *
        second : FailureDefinitionId  : bool
Parameters
first FailureDefinitionId
The first FailureDefinitionId.
second FailureDefinitionId
The second FailureDefinitionId.
Return Value
Boolean
True if the inputs are identical, false if they are different.
See Also
Reference
FailureDefinitionId Class
Autodesk.Revit.DB Namespace